;;; use-cnfonts.el -*- lexical-binding: t -*-

;;;;==============================note==============================
;; 中文/英文 混用 org 表格对其问题
;; 思路：用不同字号
;; cnfonts 添加了许多辅助工具，使配置和调节字体和字号的工作更加简便快捷
;;;;================================================================

;; install and enable
(leaf cnfonts
  :config (cnfonts-enable))

;; M-x cnfonts-ui to use

;;;;==============================note==============================
;; cnfonts 如何添加字体进选择列表？
;; 编辑 profile 文件
;; M-x cnfonts-edit-profile-without-ui
;;;;================================================================


;;------------------------------------------------------------------
;;; use-cnfont.el ends
(provide 'use-cnfonts)
